src/unit.org
# -*- Mode:Org; Coding:utf-8; fill-column:158 -*-
#+TITLE:       free42/hp42s/DM42 Custom Unit Conversion Factors
#+AUTHOR:      Mitch Richling
#+EMAIL:       http://www.mitchr.me/
#+DATE:        2021-03-19
#+DESCRIPTION: Description of some free42/hp-42s/DM42 programs for unit computations
#+LANGUAGE:    en
#+OPTIONS:     num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t skip:nil d:nil todo:t pri:nil H:5 p:t author:t html-scripts:nil 
#+HTML_HEAD: <style>body { width: 95%; margin: 2% auto; font-size: 18px; line-height: 1.4em; font-family: Georgia, serif; color: black; background-color: white; }</style>
#+HTML_HEAD: <style>body { min-width: 500px; max-width: 1024px; }</style>
#+HTML_HEAD: <style>h1,h2,h3,h4,h5,h6 { color: #A5573E; line-height: 1em; font-family: Helvetica, sans-serif; }</style>
#+HTML_HEAD: <style>h1,h2,h3 { line-height: 1.4em; }</style>
#+HTML_HEAD: <style>h1.title { font-size: 3em; }</style>
#+HTML_HEAD: <style>h4,h5,h6 { font-size: 1em; }</style>
#+HTML_HEAD: <style>.org-src-container { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; font-family: Lucida Console, monospace; font-size: 80%; margin: 0px; padding: 0px 0px; position: relative; }</style>
#+HTML_HEAD: <style>.org-src-container>pre { line-height: 1.2em; padding-top: 1.5em; margin: 0.5em; background-color: #404040; color: white; overflow: auto; }</style>
#+HTML_HEAD: <style>.org-src-container>pre:before { display: block; position: absolute; background-color: #b3b3b3; top: 0; right: 0; padding: 0 0.2em 0 0.4em; border-bottom-left-radius: 8px; border: 0; color: white; font-size: 100%; font-family: Helvetica, sans-serif;}</style>
#+HTML_HEAD: <style>pre.example { white-space: pre-wrap; white-space: -moz-pre-wrap; white-space: -o-pre-wrap; font-family: Lucida Console, monospace; font-size: 80%; background: #404040; color: white; display: block; padding: 0em; border: 2px solid black; }</style>
#+HTML_LINK_HOME: https://www.mitchr.me/
#+HTML_LINK_UP: https://richmit.github.io/hp42/

#+ATTR_HTML: :border 2 solid #ccc :frame hsides :align center
|        <r> | <l>              |
|  *Author:* | /{{{author}}}/ |
| *Updated:* | /{{{time(%Y-%m-%d %H:%M:%S)}}}/ |
#+ATTR_HTML: :align center
Copyright {{{time(%Y)}}} Mitch Richling. All rights reserved.

#+TOC: headlines 5

#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#   00   #    10   #    20   #    30   #    40   #    50   #    60   #    70   #    80   #    90   #   100   #   110   #   120   #   130   #   140   #   150   #   160   #
# 234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #

* Metadata

This home for this HTML file is: https://richmit.github.io/hp42/unit.html

Files related to this document may be found on github: https://github.com/richmit/hp42

   - =src= directory: Contains the org-mode file that generated this HTML document
   - =docs= directory: Contains this html document
   - =bin= directory: Contains raw program files

* Introduction

This application has a few unit conversions for temperatures; however, the focus is on a nice way to organize and recall various conversion factors I
frequently use.  That is to say, I don't really want to convert "in" to "cm", instead I want to push the conversion factor to the stack.

Aside from the =TEMP= menu, all of the menus have the same structure.  The first menu key is the "base" unit for that page.  Pressing any menu key will push
a conversion factor for the given unit to the "base" unit to the stack.  For example, if the left most menu is "mm" then pressing the "in" button will push
0.393700787402 to the stack -- the value you would multiply by to convert from inches to millimeters or divide by to convert from millimeters to inches.

* Units

** Conversion Factors

#+ATTR_HTML: :rules groups :frame box :align center
#+NAME: units
| Type        |         Conversion | Description     |
|-------------+--------------------+-----------------|
| LEN:mm      |                1.0 |                 |
| LEN:Ang     |                1e7 | Angstrom        |
| LEN:μm      |                1e3 | Micron          |
| LEN:mil     |  3.9370078740157e1 | mil (1/1000 in) |
| LEN:cm      |               1e-2 |                 |
| LEN:in      | 3.9370078740157e-2 | Inch            |
|-------------+--------------------+-----------------|
| LEN:cm      |                  1 |                 |
| LEN:in      |   0.39370078740157 | Intl Inch       |
| LEN:ft      |             0.3048 | Intl Foot       |
| LEN:m       |               1e-3 |                 |
| LEN:yd      |  0.032808398950131 | Intl Yard       |
|-------------+--------------------+-----------------|
| LEN:km      |                  1 |                 |
| LEN:mi      |   0.62137119223733 | Int Mile        |
| LEN:us mi   |   0.62136994949495 | US Mile         |
| LEN:nmi     |   0.53995680345572 | Int Nautical mi |
| LEN:m       |                1e3 |                 |
| LEN:ft      |    3280.8398950131 | Intl Foot       |
|-------------+--------------------+-----------------|
| AREA:hector |                  1 | hector          |
| AREA:acre   |    2.4710538146717 | Int Acre        |
| AREA:m^2    |              10000 |                 |
| AREA:yd^2   |    11959.900463011 |                 |
|-------------+--------------------+-----------------|
| VOL:l       |                  1 |                 |
| VOL:qt      |    1.0566882049662 | US Lq Quart     |
| VOL:gal     |   0.26417205124156 | US Lq Gal       |
| VOL:cc      |                1e3 |                 |
|-------------+--------------------+-----------------|
| VOL:gal     |                  1 | Gal             |
| VOL:qt      |                  4 | Quart           |
| VOL:pint    |                  8 | Pint            |
| VOL:cup     |                 16 | Cup             |
| VOL:flOZ    |                128 | fl oz           |
| VOL:tbsp    |                256 | Tablespoon      |
| VOL:tsp     |                768 | Teaspoon        |
|-------------+--------------------+-----------------|
| TIME:sec    |                  1 |                 |
| TIME:min    |                 60 |                 |
| TIME:hour   |               3600 |                 |
| TIME:day    |              86400 |                 |
| TIME:week   |             604800 |                 |
| TIME:year   |           31536000 | 365 day year    |
|-------------+--------------------+-----------------|
| TIME:day    |                  1 |                 |
| TIME:year   |                365 |                 |
| TIME:greg   |           365.2425 |                 |
| TIME:julian |             365.25 |                 |
| TIME:astro  |      365.256363004 |                 |
|-------------+--------------------+-----------------|
| Mass:kg     |                  1 |                 |
| Mass:lb     |    2.2046226218488 | Pound Int       |
| Mass:g      |                1e3 |                 |
| Mass:ozWT   |     35.27396194958 | Ounce Weight    |
| Mass:ozTr   |    32.150746568628 | Ounce Troy      |
| Mass:stone  |   0.15747304441777 | UK Stone        |
|-------------+--------------------+-----------------|
| Mass:kg     |                  1 |                 |
| Mass:ton    |              0.001 | Metric Ton      |
| Mass:US ton |   1.10231131471e-3 | US (short) Ton  |
| Mass:UK ton |   9.84206530988e-4 | UK (long) Ton   |
|-------------+--------------------+-----------------|
| Force:N     |                  1 |                 |
| Force:kgf   |            9.80665 |                 |
| Force:lbf   |       4.4482216153 | Int Pound Force |
|-------------+--------------------+-----------------|
| Sped:m/s    |                  1 |                 |
| Sped:mph    |            0.44704 | Int Mi per hour |
| Sped:kph    |       0.2777777778 |                 |
| Sped:knot   |       0.5144444444 | International   |
|-------------+--------------------+-----------------|
| PRES:Pa     |                  1 | N/m^2           |
| PRES:bar    |             100000 |                 |
| PRES:psi    |       6894.7572932 |                 |
| PRES:atm    |             101325 |                 |
| PRES:mmHg   |            133.322 |                 |
| PRES:inHg   |            133.322 |                 |
|-------------+--------------------+-----------------|
| POW:watt    |                  1 |                 |
| POW:BTU/h   |       0.2930710702 | International   |
| POW:hp      |          735.49875 | Metric          |
| POW:kcal/h  |              1.163 |                 |
| POW:J/h     |       0.0002777778 |                 |
|-------------+--------------------+-----------------|
| TEMP:C→F    |       9 × 5 ÷ 32 + |                 |
| TEMP:F→C    |       32 - 5 × 9 ÷ |                 |
| TEMP:K→C    |           273.15 - |                 |
| TEMP:C→K    |           273.15 + |                 |
|-------------+--------------------+-----------------|

