docs/unit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 Sun 12:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free42/hp42s/DM42 Custom Unit Conversion Factors</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Description of some free42/hp-42s/DM42 programs for unit computations"
 />











</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/hp42/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">free42/hp42s/DM42 Custom Unit Conversion Factors</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-03-28 12:20:47</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4f84e3b">1. Metadata</a></li>
<li><a href="#orgf4b27b8">2. Introduction</a></li>
<li><a href="#org159a774">3. Units</a>
<ul>
<li><a href="#org5c26c9d">3.1. Conversion Factors</a></li>
<li><a href="#org3085a70">3.2. Code</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4f84e3b" class="outline-2">
<h2 id="org4f84e3b"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
This home for this HTML file is: <a href="https://richmit.github.io/hp42/unit.html">https://richmit.github.io/hp42/unit.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<ul class="org-ul">
<li><code>src</code> directory: Contains the org-mode file that generated this HTML document</li>
<li><code>docs</code> directory: Contains this html document</li>
<li><code>bin</code> directory: Contains raw program files</li>
</ul>
</div>
</div>

<div id="outline-container-orgf4b27b8" class="outline-2">
<h2 id="orgf4b27b8"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
This application has a few unit conversions for temperatures; however, the focus is on a nice way to organize and recall various conversion factors I
frequently use.  That is to say, I don't really want to convert "in" to "cm", instead I want to push the conversion factor to the stack.
</p>

<p>
Aside from the <code>TEMP</code> menu, all of the menus have the same structure.  The first menu key is the "base" unit for that page.  Pressing any menu key will push
a conversion factor for the given unit to the "base" unit to the stack.  For example, if the left most menu is "mm" then pressing the "in" button will push
0.393700787402 to the stack &#x2013; the value you would multiply by to convert from inches to millimeters or divide by to convert from millimeters to inches.
</p>
</div>
</div>
