docs/unit.html

<div id="outline-container-org159a774" class="outline-2">
<h2 id="org159a774"><span class="section-number-2">3</span> Units</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5c26c9d" class="outline-3">
<h3 id="org5c26c9d"><span class="section-number-3">3.1</span> Conversion Factors</h3>
<div class="outline-text-3" id="text-3-1">
<table id="orge434ebf" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-right">Conversion</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">LEN:mm</td>
<td class="org-right">1.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LEN:Ang</td>
<td class="org-right">1e7</td>
<td class="org-left">Angstrom</td>
</tr>

<tr>
<td class="org-left">LEN:μm</td>
<td class="org-right">1e3</td>
<td class="org-left">Micron</td>
</tr>

<tr>
<td class="org-left">LEN:mil</td>
<td class="org-right">3.9370078740157e1</td>
<td class="org-left">mil (1/1000 in)</td>
</tr>

<tr>
<td class="org-left">LEN:cm</td>
<td class="org-right">1e-2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LEN:in</td>
<td class="org-right">3.9370078740157e-2</td>
<td class="org-left">Inch</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">LEN:cm</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LEN:in</td>
<td class="org-right">0.39370078740157</td>
<td class="org-left">Intl Inch</td>
</tr>

<tr>
<td class="org-left">LEN:ft</td>
<td class="org-right">0.3048</td>
<td class="org-left">Intl Foot</td>
</tr>

<tr>
<td class="org-left">LEN:m</td>
<td class="org-right">1e-3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LEN:yd</td>
<td class="org-right">0.032808398950131</td>
<td class="org-left">Intl Yard</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">LEN:km</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LEN:mi</td>
<td class="org-right">0.62137119223733</td>
<td class="org-left">Int Mile</td>
</tr>

<tr>
<td class="org-left">LEN:us mi</td>
<td class="org-right">0.62136994949495</td>
<td class="org-left">US Mile</td>
</tr>

<tr>
<td class="org-left">LEN:nmi</td>
<td class="org-right">0.53995680345572</td>
<td class="org-left">Int Nautical mi</td>
</tr>

<tr>
<td class="org-left">LEN:m</td>
<td class="org-right">1e3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LEN:ft</td>
<td class="org-right">3280.8398950131</td>
<td class="org-left">Intl Foot</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">AREA:hector</td>
<td class="org-right">1</td>
<td class="org-left">hector</td>
</tr>

<tr>
<td class="org-left">AREA:acre</td>
<td class="org-right">2.4710538146717</td>
<td class="org-left">Int Acre</td>
</tr>

<tr>
<td class="org-left">AREA:m^2</td>
<td class="org-right">10000</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">AREA:yd^2</td>
<td class="org-right">11959.900463011</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">VOL:l</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">VOL:qt</td>
<td class="org-right">1.0566882049662</td>
<td class="org-left">US Lq Quart</td>
</tr>

<tr>
<td class="org-left">VOL:gal</td>
<td class="org-right">0.26417205124156</td>
<td class="org-left">US Lq Gal</td>
</tr>

<tr>
<td class="org-left">VOL:cc</td>
<td class="org-right">1e3</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">VOL:gal</td>
<td class="org-right">1</td>
<td class="org-left">Gal</td>
</tr>

<tr>
<td class="org-left">VOL:qt</td>
<td class="org-right">4</td>
<td class="org-left">Quart</td>
</tr>

<tr>
<td class="org-left">VOL:pint</td>
<td class="org-right">8</td>
<td class="org-left">Pint</td>
</tr>

<tr>
<td class="org-left">VOL:cup</td>
<td class="org-right">16</td>
<td class="org-left">Cup</td>
</tr>

<tr>
<td class="org-left">VOL:flOZ</td>
<td class="org-right">128</td>
<td class="org-left">fl oz</td>
</tr>

<tr>
<td class="org-left">VOL:tbsp</td>
<td class="org-right">256</td>
<td class="org-left">Tablespoon</td>
</tr>

<tr>
<td class="org-left">VOL:tsp</td>
<td class="org-right">768</td>
<td class="org-left">Teaspoon</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TIME:sec</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIME:min</td>
<td class="org-right">60</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIME:hour</td>
<td class="org-right">3600</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIME:day</td>
<td class="org-right">86400</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIME:week</td>
<td class="org-right">604800</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIME:year</td>
<td class="org-right">31536000</td>
<td class="org-left">365 day year</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TIME:day</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIME:year</td>
<td class="org-right">365</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIME:greg</td>
<td class="org-right">365.2425</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIME:julian</td>
<td class="org-right">365.25</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIME:astro</td>
<td class="org-right">365.256363004</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Mass:kg</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Mass:lb</td>
<td class="org-right">2.2046226218488</td>
<td class="org-left">Pound Int</td>
</tr>

<tr>
<td class="org-left">Mass:g</td>
<td class="org-right">1e3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Mass:ozWT</td>
<td class="org-right">35.27396194958</td>
<td class="org-left">Ounce Weight</td>
</tr>

<tr>
<td class="org-left">Mass:ozTr</td>
<td class="org-right">32.150746568628</td>
<td class="org-left">Ounce Troy</td>
</tr>

<tr>
<td class="org-left">Mass:stone</td>
<td class="org-right">0.15747304441777</td>
<td class="org-left">UK Stone</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Mass:kg</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Mass:ton</td>
<td class="org-right">0.001</td>
<td class="org-left">Metric Ton</td>
</tr>

<tr>
<td class="org-left">Mass:US ton</td>
<td class="org-right">1.10231131471e-3</td>
<td class="org-left">US (short) Ton</td>
</tr>

<tr>
<td class="org-left">Mass:UK ton</td>
<td class="org-right">9.84206530988e-4</td>
<td class="org-left">UK (long) Ton</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Force:N</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Force:kgf</td>
<td class="org-right">9.80665</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Force:lbf</td>
<td class="org-right">4.4482216153</td>
<td class="org-left">Int Pound Force</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Sped:m/s</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sped:mph</td>
<td class="org-right">0.44704</td>
<td class="org-left">Int Mi per hour</td>
</tr>

<tr>
<td class="org-left">Sped:kph</td>
<td class="org-right">0.2777777778</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sped:knot</td>
<td class="org-right">0.5144444444</td>
<td class="org-left">International</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">PRES:Pa</td>
<td class="org-right">1</td>
<td class="org-left">N/m^2</td>
</tr>

<tr>
<td class="org-left">PRES:bar</td>
<td class="org-right">100000</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PRES:psi</td>
<td class="org-right">6894.7572932</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PRES:atm</td>
<td class="org-right">101325</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PRES:mmHg</td>
<td class="org-right">133.322</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PRES:inHg</td>
<td class="org-right">133.322</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">POW:watt</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">POW:BTU/h</td>
<td class="org-right">0.2930710702</td>
<td class="org-left">International</td>
</tr>

<tr>
<td class="org-left">POW:hp</td>
<td class="org-right">735.49875</td>
<td class="org-left">Metric</td>
</tr>

<tr>
<td class="org-left">POW:kcal/h</td>
<td class="org-right">1.163</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">POW:J/h</td>
<td class="org-right">0.0002777778</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TEMP:C→F</td>
<td class="org-right">9 × 5 ÷ 32 +</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TEMP:F→C</td>
<td class="org-right">32 - 5 × 9 ÷</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TEMP:K→C</td>
<td class="org-right">273.15 -</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TEMP:C→K</td>
<td class="org-right">273.15 +</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3085a70" class="outline-3">
<h3 id="org3085a70"><span class="section-number-3">3.2</span> Code</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"UNIT"</span> tbl <span style="color: #fa8072;">"stay"</span> <span style="color: #fa8072;">"up"</span> (<span style="color: #00ffff;">lambda</span> (row) (<span style="color: #00ffff;">cl-destructuring-bind</span> (menu cfactor desc) row
                                                                  (<span style="color: #00ffff;">let</span> ((print-desc 't))    <span style="color: #ffa500;">;; </span><span style="color: #ff7f24;">Set to NIL to not print description</span>
                                                                    (<span style="color: #00ffff;">let*</span> ((dlen (length desc))
                                                                           (dsc1 (<span style="color: #00ffff;">if</span> (&gt; dlen 0)
                                                                                  (substring desc 0 (min dlen 15))))
                                                                           (dsc2 (<span style="color: #00ffff;">if</span> (&gt; dlen 14)
                                                                                     (substring desc 15 (min dlen 22)))))
                                                                      (mapconcat #'identity
                                                                                 (cl-remove nil (flatten-list (list (split-string (message <span style="color: #fa8072;">"%s"</span> cfactor))
                                                                                                                    (<span style="color: #00ffff;">and</span> print-desc dsc1 (message <span style="color: #fa8072;">"\"%s\""</span> dsc1))
                                                                                                                    (<span style="color: #00ffff;">and</span> print-desc dsc2 (message <span style="color: #fa8072;">"&#9500;\"%s\""</span> dsc2))
                                                                                                                    (<span style="color: #00ffff;">and</span> print-desc (<span style="color: #00ffff;">or</span> dsc1 dsc2) <span style="color: #fa8072;">"AVIEW"</span>))))
                                                                                 <span style="color: #fa8072;">"\n"</span>)))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"UNIT"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu CONV</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"LEN"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">GTO</span> 03
<span style="color: #fa8072;">"AREA"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">GTO</span> 04
<span style="color: #fa8072;">"VOL"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">GTO</span> 05
<span style="color: #fa8072;">"TIME"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">GTO</span> 06
<span style="color: #fa8072;">"Mass"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">GTO</span> 07
<span style="color: #fa8072;">"Force"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">GTO</span> 08
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 02            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu CONV</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"Sped"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">GTO</span> 09
<span style="color: #fa8072;">"PRES"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">GTO</span> 10
<span style="color: #fa8072;">"POW"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">GTO</span> 11
<span style="color: #fa8072;">"TEMP"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">GTO</span> 12
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">LBL</span> 03            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu LEN</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"mm"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 15
<span style="color: #fa8072;">"Ang"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 16
<span style="color: #fa8072;">"&#956;m"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 17
<span style="color: #fa8072;">"mil"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 18
<span style="color: #fa8072;">"cm"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 19
<span style="color: #fa8072;">"in"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 20
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 14
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 13
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">LBL</span> 13            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu LEN</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"cm"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 21
<span style="color: #fa8072;">"in"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 22
<span style="color: #fa8072;">"ft"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 23
<span style="color: #fa8072;">"m"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 24
<span style="color: #fa8072;">"yd"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 25
<span style="color: #fa8072;">"km"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 26
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 14
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 13
<span style="color: #00ffff;">LBL</span> 14            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 3 of menu LEN</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"mi"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 27
<span style="color: #fa8072;">"us mi"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 28
<span style="color: #fa8072;">"nmi"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 29
<span style="color: #fa8072;">"m"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 30
<span style="color: #fa8072;">"ft"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 31
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 13
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 14
<span style="color: #00ffff;">LBL</span> 04            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu AREA</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"hector"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 32
<span style="color: #fa8072;">"acre"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 33
<span style="color: #fa8072;">"m^2"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 34
<span style="color: #fa8072;">"yd^2"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 35
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 04
<span style="color: #00ffff;">LBL</span> 05            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu VOL</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"l"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 37
<span style="color: #fa8072;">"qt"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 38
<span style="color: #fa8072;">"gal"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 39
<span style="color: #fa8072;">"cc"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 40
<span style="color: #fa8072;">"gal"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 41
<span style="color: #fa8072;">"qt"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 42
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 36
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 36
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 05
<span style="color: #00ffff;">LBL</span> 36            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu VOL</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"pint"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 43
<span style="color: #fa8072;">"cup"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 44
<span style="color: #fa8072;">"flOZ"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 45
<span style="color: #fa8072;">"tbsp"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 46
<span style="color: #fa8072;">"tsp"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 47
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 05
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 05
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 36
<span style="color: #00ffff;">LBL</span> 06            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu TIME</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"sec"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 49
<span style="color: #fa8072;">"min"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 50
<span style="color: #fa8072;">"hour"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 51
<span style="color: #fa8072;">"day"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 52
<span style="color: #fa8072;">"week"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 53
<span style="color: #fa8072;">"year"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 54
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 48
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 48
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 06
<span style="color: #00ffff;">LBL</span> 48            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu TIME</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"day"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 55
<span style="color: #fa8072;">"year"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 56
<span style="color: #fa8072;">"greg"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 57
<span style="color: #fa8072;">"julian"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 58
<span style="color: #fa8072;">"astro"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 59
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 06
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 06
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 48
<span style="color: #00ffff;">LBL</span> 07            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu Mass</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"kg"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 61
<span style="color: #fa8072;">"lb"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 62
<span style="color: #fa8072;">"g"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 63
<span style="color: #fa8072;">"ozWT"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 64
<span style="color: #fa8072;">"ozTr"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 65
<span style="color: #fa8072;">"stone"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 66
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 60
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 60
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">LBL</span> 60            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu Mass</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"kg"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 67
<span style="color: #fa8072;">"ton"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 68
<span style="color: #fa8072;">"US ton"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 69
<span style="color: #fa8072;">"UK ton"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 70
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 07
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 60
<span style="color: #00ffff;">LBL</span> 08            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu Force</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"N"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 71
<span style="color: #fa8072;">"kgf"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 72
<span style="color: #fa8072;">"lbf"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 73
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 08
<span style="color: #00ffff;">LBL</span> 09            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu Sped</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"m/s"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 74
<span style="color: #fa8072;">"mph"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 75
<span style="color: #fa8072;">"kph"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 76
<span style="color: #fa8072;">"knot"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 77
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 09
<span style="color: #00ffff;">LBL</span> 10            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu PRES</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"Pa"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 78
<span style="color: #fa8072;">"bar"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 79
<span style="color: #fa8072;">"psi"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 80
<span style="color: #fa8072;">"atm"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 81
<span style="color: #fa8072;">"mmHg"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 82
<span style="color: #fa8072;">"inHg"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 83
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 10
<span style="color: #00ffff;">LBL</span> 11            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu POW</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"watt"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 84
<span style="color: #fa8072;">"BTU/h"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 85
<span style="color: #fa8072;">"hp"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 86
<span style="color: #fa8072;">"kcal/h"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 87
<span style="color: #fa8072;">"J/h"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 88
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 11
<span style="color: #00ffff;">LBL</span> 12            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu TEMP</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"C&#8594;F"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 89
<span style="color: #fa8072;">"F&#8594;C"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 90
<span style="color: #fa8072;">"K&#8594;C"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 91
<span style="color: #fa8072;">"C&#8594;K"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 92
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 12
<span style="color: #00ffff;">LBL</span> 00
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 15               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key mm</span>
1.0
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 16               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key Ang</span>
1e7
<span style="color: #fa8072;">"Angstrom"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 17               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key &#956;m</span>
1e3
<span style="color: #fa8072;">"Micron"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 18               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key mil</span>
3.9370078740157e1
<span style="color: #fa8072;">"mil (1/1000 in)"</span>
&#9500;<span style="color: #fa8072;">""</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 19               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key cm</span>
1e-2
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 20               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key in</span>
3.9370078740157e-2
<span style="color: #fa8072;">"Inch"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 21               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key cm</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 22               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key in</span>
0.39370078740157
<span style="color: #fa8072;">"Intl Inch"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 23               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key ft</span>
0.3048
<span style="color: #fa8072;">"Intl Foot"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 24               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key m</span>
1e-3
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 25               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key yd</span>
0.032808398950131
<span style="color: #fa8072;">"Intl Yard"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 26               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key km</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 27               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key mi</span>
0.62137119223733
<span style="color: #fa8072;">"Int Mile"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 28               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key us mi</span>
0.62136994949495
<span style="color: #fa8072;">"US Mile"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 29               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key nmi</span>
0.53995680345572
<span style="color: #fa8072;">"Int Nautical mi"</span>
&#9500;<span style="color: #fa8072;">""</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 30               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key m</span>
1e3
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 31               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key ft</span>
3280.8398950131
<span style="color: #fa8072;">"Intl Foot"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 32               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key hector</span>
1
<span style="color: #fa8072;">"hector"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 33               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key acre</span>
2.4710538146717
<span style="color: #fa8072;">"Int Acre"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 34               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key m^2</span>
10000
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 35               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key yd^2</span>
11959.900463011
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 37               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key l</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 38               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key qt</span>
1.0566882049662
<span style="color: #fa8072;">"US Lq Quart"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 39               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key gal</span>
0.26417205124156
<span style="color: #fa8072;">"US Lq Gal"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 40               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key cc</span>
1e3
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 41               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key gal</span>
1
<span style="color: #fa8072;">"Gal"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 42               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key qt</span>
4
<span style="color: #fa8072;">"Quart"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 43               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key pint</span>
8
<span style="color: #fa8072;">"Pint"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 44               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key cup</span>
16
<span style="color: #fa8072;">"Cup"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 45               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key flOZ</span>
128
<span style="color: #fa8072;">"fl oz"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 46               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key tbsp</span>
256
<span style="color: #fa8072;">"Tablespoon"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 47               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key tsp</span>
768
<span style="color: #fa8072;">"Teaspoon"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 49               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key sec</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 50               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key min</span>
60
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 51               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key hour</span>
3600
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 52               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key day</span>
86400
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 53               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key week</span>
604800
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 54               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key year</span>
31536000
<span style="color: #fa8072;">"365 day year"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 55               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key day</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 56               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key year</span>
365
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 57               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key greg</span>
365.2425
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 58               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key julian</span>
365.25
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 59               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key astro</span>
365.256363004
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 61               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key kg</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 62               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key lb</span>
2.2046226218488
<span style="color: #fa8072;">"Pound Int"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 63               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key g</span>
1e3
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 64               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key ozWT</span>
35.27396194958
<span style="color: #fa8072;">"Ounce Weight"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 65               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key ozTr</span>
32.150746568628
<span style="color: #fa8072;">"Ounce Troy"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 66               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key stone</span>
0.15747304441777
<span style="color: #fa8072;">"UK Stone"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 67               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key kg</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 68               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key ton</span>
0.001
<span style="color: #fa8072;">"Metric Ton"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 69               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key US ton</span>
1.10231131471e-3
<span style="color: #fa8072;">"US (short) Ton"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 70               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key UK ton</span>
9.84206530988e-4
<span style="color: #fa8072;">"UK (long) Ton"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 71               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key N</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 72               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key kgf</span>
9.80665
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 73               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key lbf</span>
4.4482216153
<span style="color: #fa8072;">"Int Pound Force"</span>
&#9500;<span style="color: #fa8072;">""</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 74               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key m/s</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 75               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key mph</span>
0.44704
<span style="color: #fa8072;">"Int Mi per hour"</span>
&#9500;<span style="color: #fa8072;">""</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 76               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key kph</span>
0.2777777778
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 77               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key knot</span>
0.5144444444
<span style="color: #fa8072;">"International"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 78               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key Pa</span>
1
<span style="color: #fa8072;">"N/m^2"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 79               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key bar</span>
100000
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 80               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key psi</span>
6894.7572932
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 81               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key atm</span>
101325
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 82               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key mmHg</span>
133.322
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 83               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key inHg</span>
133.322
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 84               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key watt</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 85               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key BTU/h</span>
0.2930710702
<span style="color: #fa8072;">"International"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 86               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key hp</span>
735.49875
<span style="color: #fa8072;">"Metric"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 87               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key kcal/h</span>
1.163
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 88               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key J/h</span>
0.0002777778
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 89               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key C&#8594;F</span>
9
<span style="color: #00ffff;">&#215;</span>
5
<span style="color: #00ffff;">&#247;</span>
32
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 90               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key F&#8594;C</span>
32
<span style="color: #00ffff;">-</span>
5
<span style="color: #00ffff;">&#215;</span>
9
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 91               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key K&#8594;C</span>
273.15
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 92               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key C&#8594;K</span>
273.15
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 93</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by Mitch Richling <<a href="mailto:http://www.mitchr.me/">http://www.mitchr.me/</a>>.  Rendered on 2021-03-28 Sun 12:20 via <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3.6)
</div>
</body>
</html>
